; domain
;; source: https://github.com/AI-Planning/pddl-generators/blob/main/rovers/domain.pddl
;; updates:
;;   - since actions are performed sequentially and immediately
;;     'channel_free' and 'available' predicates are removed
;;   -

(define (domain rover)
(:requirements :strips :typing)
(:types rover waypoint store camera mode lander objective)

(:predicates
    (at ?x - rover ?y - waypoint)
    (at_lander ?x - lander ?y - waypoint)
    (can_traverse ?r - rover ?x - waypoint ?y - waypoint)
	(equipped_for_soil_analysis ?r - rover)
    (equipped_for_rock_analysis ?r - rover)
    (equipped_for_imaging ?r - rover)
    (empty ?s - store)
    (have_rock_analysis ?r - rover ?w - waypoint)
    (have_soil_analysis ?r - rover ?w - waypoint)
    (full ?s - store)
	(calibrated ?c - camera ?r - rover)
	(supports ?c - camera ?m - mode)
    (visible ?w - waypoint ?p - waypoint)
    (have_image ?r - rover ?o - objective ?m - mode)
    (communicated_soil_data ?w - waypoint)
    (communicated_rock_data ?w - waypoint)
    (communicated_image_data ?o - objective ?m - mode)
	(at_soil_sample ?w - waypoint)
	(at_rock_sample ?w - waypoint)
    (visible_from ?o - objective ?w - waypoint)
	(store_of ?s - store ?r - rover)
	(calibration_target ?i - camera ?o - objective)
	(on_board ?i - camera ?r - rover)
)

(:action navigate
:parameters (?x - rover ?y - waypoint ?z - waypoint)
:precondition (and
    (can_traverse ?x ?y ?z)
    (at ?x ?y)
    (visible ?y ?z))
:effect (and
    (not (at ?x ?y))
    (at ?x ?z))
)

(:action sample_soil
:parameters (?x - rover ?s - store ?p - waypoint)
:precondition (and
    (at ?x ?p)
    (at_soil_sample ?p)
	(equipped_for_soil_analysis ?x)
	(store_of ?s ?x)
	(empty ?s))
:effect (and
    (not (empty ?s))
    (full ?s)
    (have_soil_analysis ?x ?p)
    (not (at_soil_sample ?p)))
)

(:action sample_rock
:parameters (?x - rover ?s - store ?p - waypoint)
:precondition (and
    (at ?x ?p)
    (at_rock_sample ?p)
	(equipped_for_rock_analysis ?x)
	(store_of ?s ?x)
	(empty ?s))
:effect (and
    (not (empty ?s))
    (full ?s)
    (have_rock_analysis ?x ?p)
	(not (at_rock_sample ?p)))
)

(:action drop
:parameters (?x - rover ?y - store)
:precondition (and
    (store_of ?y ?x)
    (full ?y))
:effect (and
    (not (full ?y))
    (empty ?y))
)

(:action calibrate
 :parameters (?r - rover ?i - camera ?t - objective ?w - waypoint)
 :precondition (and
    (equipped_for_imaging ?r)
    (calibration_target ?i ?t)
    (at ?r ?w)
    (visible_from ?t ?w)
    (on_board ?i ?r))
 :effect (and
    (calibrated ?i ?r))
)

(:action take_image
 :parameters (?r - rover ?p - waypoint ?o - objective ?i - camera ?m - mode)
 :precondition (and
    (calibrated ?i ?r)
    (on_board ?i ?r)
    (equipped_for_imaging ?r)
    (supports ?i ?m)
    (visible_from ?o ?p)
    (at ?r ?p))
 :effect (and
    (have_image ?r ?o ?m)
    (not (calibrated ?i ?r)))
)

(:action communicate_soil_data
 :parameters (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
 :precondition (and
    (at ?r ?x)
    (at_lander ?l ?y)
    (have_soil_analysis ?r ?p)
    (visible ?x ?y))
 :effect (and
    (communicated_soil_data ?p))
)

(:action communicate_rock_data
 :parameters (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
 :precondition (and
    (at ?r ?x)
    (at_lander ?l ?y)
    (have_rock_analysis ?r ?p)
    (visible ?x ?y))
 :effect (and
    (communicated_rock_data ?p))
)

(:action communicate_image_data
 :parameters (?r - rover ?l - lander ?o - objective ?m - mode
	      ?x - waypoint ?y - waypoint)
 :precondition (and
    (at ?r ?x)
    (at_lander ?l ?y)
    (have_image ?r ?o ?m)
    (visible ?x ?y))
 :effect (and
    (communicated_image_data ?o ?m)))
)

; problem
;; rovers=4, waypoints=9, cameras=4, objectives=8, out_folder=training/easy, instance_id=78, seed=113

(define (problem rover-78)
 (:domain rover)
 (:objects 
    general - lander
    colour high_res low_res - mode
    rover1 rover2 rover3 rover4 - rover
    rover1store rover2store rover3store rover4store - store
    waypoint1 waypoint2 waypoint3 waypoint4 waypoint5 waypoint6 waypoint7 waypoint8 waypoint9 - waypoint
    camera1 camera2 camera3 camera4 - camera
    objective1 objective2 objective3 objective4 objective5 objective6 objective7 objective8 - objective)
 (:init 
    (at_lander general waypoint1)
    (at rover1 waypoint5)
    (at rover2 waypoint1)
    (at rover3 waypoint8)
    (at rover4 waypoint9)
    (equipped_for_soil_analysis rover4)
    (equipped_for_rock_analysis rover1)
    (equipped_for_rock_analysis rover3)
    (equipped_for_rock_analysis rover2)
    (equipped_for_imaging rover1)
    (equipped_for_imaging rover2)
    (equipped_for_imaging rover3)
    (equipped_for_imaging rover4)
    (empty rover1store)
    (empty rover2store)
    (empty rover3store)
    (empty rover4store)
    (store_of rover1store rover1)
    (store_of rover2store rover2)
    (store_of rover3store rover3)
    (store_of rover4store rover4)
    (at_rock_sample waypoint3)
    (at_rock_sample waypoint7)
    (at_rock_sample waypoint9)
    (at_soil_sample waypoint1)
    (at_soil_sample waypoint5)
    (at_soil_sample waypoint9)
    (visible waypoint1 waypoint2)
    (visible waypoint2 waypoint1)
    (visible waypoint6 waypoint5)
    (visible waypoint6 waypoint8)
    (visible waypoint5 waypoint4)
    (visible waypoint7 waypoint9)
    (visible waypoint6 waypoint7)
    (visible waypoint4 waypoint5)
    (visible waypoint7 waypoint6)
    (visible waypoint2 waypoint5)
    (visible waypoint5 waypoint6)
    (visible waypoint8 waypoint6)
    (visible waypoint3 waypoint6)
    (visible waypoint6 waypoint3)
    (visible waypoint9 waypoint7)
    (visible waypoint5 waypoint2)
    (visible waypoint1 waypoint8)
    (visible waypoint8 waypoint1)
    (visible waypoint8 waypoint9)
    (visible waypoint9 waypoint8)
    (visible waypoint2 waypoint4)
    (visible waypoint4 waypoint2)
    (visible waypoint1 waypoint5)
    (visible waypoint5 waypoint1)
    (visible waypoint5 waypoint8)
    (visible waypoint8 waypoint5)
    (visible waypoint1 waypoint3)
    (visible waypoint3 waypoint1)
    (visible waypoint3 waypoint7)
    (visible waypoint7 waypoint3)
    (visible waypoint2 waypoint3)
    (visible waypoint3 waypoint2)
    (visible waypoint3 waypoint4)
    (visible waypoint4 waypoint3)
    (visible waypoint5 waypoint9)
    (visible waypoint9 waypoint5)
    (visible waypoint2 waypoint9)
    (visible waypoint9 waypoint2)
    (visible waypoint4 waypoint6)
    (visible waypoint6 waypoint4)
    (visible waypoint5 waypoint7)
    (visible waypoint7 waypoint5)
    (visible waypoint2 waypoint8)
    (visible waypoint8 waypoint2)
    (visible waypoint3 waypoint8)
    (visible waypoint8 waypoint3)
    (visible waypoint3 waypoint5)
    (visible waypoint5 waypoint3)
    (can_traverse rover1 waypoint1 waypoint2)
    (can_traverse rover1 waypoint2 waypoint1)
    (can_traverse rover1 waypoint6 waypoint5)
    (can_traverse rover1 waypoint6 waypoint8)
    (can_traverse rover1 waypoint5 waypoint4)
    (can_traverse rover1 waypoint7 waypoint9)
    (can_traverse rover1 waypoint6 waypoint7)
    (can_traverse rover1 waypoint4 waypoint5)
    (can_traverse rover1 waypoint7 waypoint6)
    (can_traverse rover1 waypoint2 waypoint5)
    (can_traverse rover1 waypoint5 waypoint6)
    (can_traverse rover1 waypoint8 waypoint6)
    (can_traverse rover1 waypoint3 waypoint6)
    (can_traverse rover1 waypoint6 waypoint3)
    (can_traverse rover1 waypoint9 waypoint7)
    (can_traverse rover1 waypoint5 waypoint2)
    (can_traverse rover1 waypoint2 waypoint4)
    (can_traverse rover1 waypoint4 waypoint2)
    (can_traverse rover1 waypoint1 waypoint5)
    (can_traverse rover1 waypoint5 waypoint1)
    (can_traverse rover1 waypoint5 waypoint8)
    (can_traverse rover1 waypoint8 waypoint5)
    (can_traverse rover1 waypoint2 waypoint3)
    (can_traverse rover1 waypoint3 waypoint2)
    (can_traverse rover1 waypoint3 waypoint8)
    (can_traverse rover1 waypoint8 waypoint3)
    (can_traverse rover1 waypoint3 waypoint5)
    (can_traverse rover1 waypoint5 waypoint3)
    (can_traverse rover2 waypoint1 waypoint2)
    (can_traverse rover2 waypoint2 waypoint1)
    (can_traverse rover2 waypoint6 waypoint5)
    (can_traverse rover2 waypoint6 waypoint8)
    (can_traverse rover2 waypoint5 waypoint4)
    (can_traverse rover2 waypoint7 waypoint9)
    (can_traverse rover2 waypoint6 waypoint7)
    (can_traverse rover2 waypoint4 waypoint5)
    (can_traverse rover2 waypoint7 waypoint6)
    (can_traverse rover2 waypoint2 waypoint5)
    (can_traverse rover2 waypoint5 waypoint6)
    (can_traverse rover2 waypoint8 waypoint6)
    (can_traverse rover2 waypoint3 waypoint6)
    (can_traverse rover2 waypoint6 waypoint3)
    (can_traverse rover2 waypoint9 waypoint7)
    (can_traverse rover2 waypoint5 waypoint2)
    (can_traverse rover2 waypoint3 waypoint7)
    (can_traverse rover2 waypoint7 waypoint3)
    (can_traverse rover2 waypoint2 waypoint9)
    (can_traverse rover2 waypoint9 waypoint2)
    (can_traverse rover3 waypoint1 waypoint2)
    (can_traverse rover3 waypoint2 waypoint1)
    (can_traverse rover3 waypoint6 waypoint5)
    (can_traverse rover3 waypoint6 waypoint8)
    (can_traverse rover3 waypoint5 waypoint4)
    (can_traverse rover3 waypoint7 waypoint9)
    (can_traverse rover3 waypoint6 waypoint7)
    (can_traverse rover3 waypoint4 waypoint5)
    (can_traverse rover3 waypoint7 waypoint6)
    (can_traverse rover3 waypoint2 waypoint5)
    (can_traverse rover3 waypoint5 waypoint6)
    (can_traverse rover3 waypoint8 waypoint6)
    (can_traverse rover3 waypoint3 waypoint6)
    (can_traverse rover3 waypoint6 waypoint3)
    (can_traverse rover3 waypoint9 waypoint7)
    (can_traverse rover3 waypoint5 waypoint2)
    (can_traverse rover3 waypoint1 waypoint5)
    (can_traverse rover3 waypoint5 waypoint1)
    (can_traverse rover3 waypoint2 waypoint3)
    (can_traverse rover3 waypoint3 waypoint2)
    (can_traverse rover3 waypoint3 waypoint8)
    (can_traverse rover3 waypoint8 waypoint3)
    (can_traverse rover4 waypoint1 waypoint2)
    (can_traverse rover4 waypoint2 waypoint1)
    (can_traverse rover4 waypoint6 waypoint5)
    (can_traverse rover4 waypoint6 waypoint8)
    (can_traverse rover4 waypoint5 waypoint4)
    (can_traverse rover4 waypoint7 waypoint9)
    (can_traverse rover4 waypoint6 waypoint7)
    (can_traverse rover4 waypoint4 waypoint5)
    (can_traverse rover4 waypoint7 waypoint6)
    (can_traverse rover4 waypoint2 waypoint5)
    (can_traverse rover4 waypoint5 waypoint6)
    (can_traverse rover4 waypoint8 waypoint6)
    (can_traverse rover4 waypoint3 waypoint6)
    (can_traverse rover4 waypoint6 waypoint3)
    (can_traverse rover4 waypoint9 waypoint7)
    (can_traverse rover4 waypoint5 waypoint2)
    (can_traverse rover4 waypoint3 waypoint4)
    (can_traverse rover4 waypoint4 waypoint3)
    (calibration_target camera1 objective6)
    (on_board camera1 rover4)
    (supports camera1 low_res)
    (supports camera1 colour)
    (calibration_target camera2 objective6)
    (on_board camera2 rover1)
    (supports camera2 low_res)
    (supports camera2 colour)
    (supports camera2 high_res)
    (calibration_target camera3 objective4)
    (on_board camera3 rover1)
    (supports camera3 colour)
    (calibration_target camera4 objective8)
    (on_board camera4 rover3)
    (supports camera4 high_res)
    (supports camera4 colour)
    (visible_from objective1 waypoint4)
    (visible_from objective2 waypoint4)
    (visible_from objective2 waypoint8)
    (visible_from objective3 waypoint4)
    (visible_from objective3 waypoint5)
    (visible_from objective3 waypoint9)
    (visible_from objective3 waypoint6)
    (visible_from objective3 waypoint3)
    (visible_from objective3 waypoint8)
    (visible_from objective4 waypoint8)
    (visible_from objective4 waypoint9)
    (visible_from objective4 waypoint6)
    (visible_from objective4 waypoint7)
    (visible_from objective4 waypoint2)
    (visible_from objective4 waypoint1)
    (visible_from objective5 waypoint7)
    (visible_from objective5 waypoint6)
    (visible_from objective5 waypoint3)
    (visible_from objective5 waypoint8)
    (visible_from objective5 waypoint2)
    (visible_from objective5 waypoint9)
    (visible_from objective5 waypoint1)
    (visible_from objective5 waypoint4)
    (visible_from objective5 waypoint5)
    (visible_from objective6 waypoint4)
    (visible_from objective6 waypoint7)
    (visible_from objective6 waypoint1)
    (visible_from objective6 waypoint5)
    (visible_from objective6 waypoint8)
    (visible_from objective6 waypoint6)
    (visible_from objective6 waypoint2)
    (visible_from objective7 waypoint5)
    (visible_from objective7 waypoint7)
    (visible_from objective8 waypoint2)
    (visible_from objective8 waypoint6))
 (:goal  (and 
    (communicated_rock_data waypoint3)
    (communicated_soil_data waypoint5)
    (communicated_image_data objective4 high_res)
    (communicated_image_data objective1 colour)
    (communicated_image_data objective5 low_res)
    (communicated_image_data objective2 low_res)
    (communicated_image_data objective8 high_res)
    (communicated_image_data objective6 high_res)
    (communicated_image_data objective8 colour)
    (communicated_image_data objective6 low_res)
    (communicated_image_data objective6 colour)
    (communicated_image_data objective2 high_res)
    (communicated_image_data objective2 colour)
    (communicated_image_data objective3 high_res)
    (communicated_image_data objective4 low_res)
    (communicated_image_data objective3 colour)
    (communicated_image_data objective7 low_res)
    (communicated_image_data objective7 high_res)
    (communicated_image_data objective5 colour)
    (communicated_image_data objective4 colour)
    (communicated_image_data objective8 low_res)
    (communicated_image_data objective5 high_res)
    (communicated_image_data objective1 high_res))))

; plan
1. (navigate rover4 waypoint9 waypoint7)
   deleted: (at rover4 waypoint9)
   added: (at rover4 waypoint7)
   goals met: 0 of 23
2. (navigate rover4 waypoint7 waypoint6)
   deleted: (at rover4 waypoint7)
   added: (at rover4 waypoint6)
   goals met: 0 of 23
3. (navigate rover4 waypoint6 waypoint5)
   deleted: (at rover4 waypoint6)
   added: (at rover4 waypoint5)
   goals met: 0 of 23
4. (sample_soil rover4 rover4store waypoint5)
   deleted: (empty rover4store) (at_soil_sample waypoint5)
   added: (full rover4store) (have_soil_analysis rover4 waypoint5)
   goals met: 0 of 23
5. (drop rover4 rover4store)
   deleted: (full rover4store)
   added: (empty rover4store)
   goals met: 0 of 23
6. (communicate_soil_data rover4 general waypoint5 waypoint5 waypoint1)
   added: (communicated_soil_data waypoint5)
   goals met: 1 of 23
7. (navigate rover1 waypoint5 waypoint3)
   deleted: (at rover1 waypoint5)
   added: (at rover1 waypoint3)
   goals met: 1 of 23
8. (sample_rock rover1 rover1store waypoint3)
   deleted: (empty rover1store) (at_rock_sample waypoint3)
   added: (full rover1store) (have_rock_analysis rover1 waypoint3)
   goals met: 1 of 23
9. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 1 of 23
10. (communicate_rock_data rover1 general waypoint3 waypoint3 waypoint1)
   added: (communicated_rock_data waypoint3)
   goals met: 2 of 23
11. (navigate rover1 waypoint3 waypoint6)
   deleted: (at rover1 waypoint3)
   added: (at rover1 waypoint6)
   goals met: 2 of 23
12. (calibrate rover1 camera2 objective6 waypoint6)
   added: (calibrated camera2 rover1)
   goals met: 2 of 23
13. (take_image rover1 waypoint6 objective4 camera2 high_res)
   deleted: (calibrated camera2 rover1)
   added: (have_image rover1 objective4 high_res)
   goals met: 2 of 23
14. (navigate rover1 waypoint6 waypoint5)
   deleted: (at rover1 waypoint6)
   added: (at rover1 waypoint5)
   goals met: 2 of 23
15. (communicate_image_data rover1 general objective4 high_res waypoint5 waypoint1)
   added: (communicated_image_data objective4 high_res)
   goals met: 3 of 23
16. (navigate rover1 waypoint5 waypoint2)
   deleted: (at rover1 waypoint5)
   added: (at rover1 waypoint2)
   goals met: 3 of 23
17. (calibrate rover1 camera3 objective4 waypoint2)
   added: (calibrated camera3 rover1)
   goals met: 3 of 23
18. (navigate rover1 waypoint2 waypoint4)
   deleted: (at rover1 waypoint2)
   added: (at rover1 waypoint4)
   goals met: 3 of 23
19. (take_image rover1 waypoint4 objective1 camera3 colour)
   deleted: (calibrated camera3 rover1)
   added: (have_image rover1 objective1 colour)
   goals met: 3 of 23
20. (navigate rover1 waypoint4 waypoint5)
   deleted: (at rover1 waypoint4)
   added: (at rover1 waypoint5)
   goals met: 3 of 23
21. (communicate_image_data rover1 general objective1 colour waypoint5 waypoint1)
   added: (communicated_image_data objective1 colour)
   goals met: 4 of 23
22. (calibrate rover1 camera2 objective6 waypoint5)
   added: (calibrated camera2 rover1)
   goals met: 4 of 23
23. (take_image rover1 waypoint5 objective5 camera2 low_res)
   deleted: (calibrated camera2 rover1)
   added: (have_image rover1 objective5 low_res)
   goals met: 4 of 23
24. (communicate_image_data rover1 general objective5 low_res waypoint5 waypoint1)
   added: (communicated_image_data objective5 low_res)
   goals met: 5 of 23
25. (calibrate rover1 camera2 objective6 waypoint5)
   added: (calibrated camera2 rover1)
   goals met: 5 of 23
26. (navigate rover1 waypoint5 waypoint4)
   deleted: (at rover1 waypoint5)
   added: (at rover1 waypoint4)
   goals met: 5 of 23
27. (take_image rover1 waypoint4 objective2 camera2 low_res)
   deleted: (calibrated camera2 rover1)
   added: (have_image rover1 objective2 low_res)
   goals met: 5 of 23
28. (navigate rover1 waypoint4 waypoint5)
   deleted: (at rover1 waypoint4)
   added: (at rover1 waypoint5)
   goals met: 5 of 23
29. (communicate_image_data rover1 general objective2 low_res waypoint5 waypoint1)
   added: (communicated_image_data objective2 low_res)
   goals met: 6 of 23
30. (calibrate rover1 camera2 objective6 waypoint5)
   added: (calibrated camera2 rover1)
   goals met: 6 of 23
31. (navigate rover1 waypoint5 waypoint2)
   deleted: (at rover1 waypoint5)
   added: (at rover1 waypoint2)
   goals met: 6 of 23
32. (take_image rover1 waypoint2 objective8 camera2 high_res)
   deleted: (calibrated camera2 rover1)
   added: (have_image rover1 objective8 high_res)
   goals met: 6 of 23
33. (communicate_image_data rover1 general objective8 high_res waypoint2 waypoint1)
   added: (communicated_image_data objective8 high_res)
   goals met: 7 of 23
34. (calibrate rover1 camera2 objective6 waypoint2)
   added: (calibrated camera2 rover1)
   goals met: 7 of 23
35. (take_image rover1 waypoint2 objective6 camera2 high_res)
   deleted: (calibrated camera2 rover1)
   added: (have_image rover1 objective6 high_res)
   goals met: 7 of 23
36. (communicate_image_data rover1 general objective6 high_res waypoint2 waypoint1)
   added: (communicated_image_data objective6 high_res)
   goals met: 8 of 23
37. (calibrate rover1 camera3 objective4 waypoint2)
   added: (calibrated camera3 rover1)
   goals met: 8 of 23
38. (take_image rover1 waypoint2 objective8 camera3 colour)
   deleted: (calibrated camera3 rover1)
   added: (have_image rover1 objective8 colour)
   goals met: 8 of 23
39. (communicate_image_data rover1 general objective8 colour waypoint2 waypoint1)
   added: (communicated_image_data objective8 colour)
   goals met: 9 of 23
40. (calibrate rover1 camera2 objective6 waypoint2)
   added: (calibrated camera2 rover1)
   goals met: 9 of 23
41. (take_image rover1 waypoint2 objective6 camera2 low_res)
   deleted: (calibrated camera2 rover1)
   added: (have_image rover1 objective6 low_res)
   goals met: 9 of 23
42. (communicate_image_data rover1 general objective6 low_res waypoint2 waypoint1)
   added: (communicated_image_data objective6 low_res)
   goals met: 10 of 23
43. (calibrate rover1 camera3 objective4 waypoint2)
   added: (calibrated camera3 rover1)
   goals met: 10 of 23
44. (take_image rover1 waypoint2 objective6 camera3 colour)
   deleted: (calibrated camera3 rover1)
   added: (have_image rover1 objective6 colour)
   goals met: 10 of 23
45. (communicate_image_data rover1 general objective6 colour waypoint2 waypoint1)
   added: (communicated_image_data objective6 colour)
   goals met: 11 of 23
46. (calibrate rover1 camera2 objective6 waypoint2)
   added: (calibrated camera2 rover1)
   goals met: 11 of 23
47. (navigate rover1 waypoint2 waypoint4)
   deleted: (at rover1 waypoint2)
   added: (at rover1 waypoint4)
   goals met: 11 of 23
48. (take_image rover1 waypoint4 objective2 camera2 high_res)
   deleted: (calibrated camera2 rover1)
   added: (have_image rover1 objective2 high_res)
   goals met: 11 of 23
49. (navigate rover1 waypoint4 waypoint5)
   deleted: (at rover1 waypoint4)
   added: (at rover1 waypoint5)
   goals met: 11 of 23
50. (communicate_image_data rover1 general objective2 high_res waypoint5 waypoint1)
   added: (communicated_image_data objective2 high_res)
   goals met: 12 of 23
51. (navigate rover1 waypoint5 waypoint2)
   deleted: (at rover1 waypoint5)
   added: (at rover1 waypoint2)
   goals met: 12 of 23
52. (calibrate rover1 camera3 objective4 waypoint2)
   added: (calibrated camera3 rover1)
   goals met: 12 of 23
53. (navigate rover1 waypoint2 waypoint4)
   deleted: (at rover1 waypoint2)
   added: (at rover1 waypoint4)
   goals met: 12 of 23
54. (take_image rover1 waypoint4 objective2 camera3 colour)
   deleted: (calibrated camera3 rover1)
   added: (have_image rover1 objective2 colour)
   goals met: 12 of 23
55. (navigate rover1 waypoint4 waypoint5)
   deleted: (at rover1 waypoint4)
   added: (at rover1 waypoint5)
   goals met: 12 of 23
56. (communicate_image_data rover1 general objective2 colour waypoint5 waypoint1)
   added: (communicated_image_data objective2 colour)
   goals met: 13 of 23
57. (calibrate rover1 camera2 objective6 waypoint5)
   added: (calibrated camera2 rover1)
   goals met: 13 of 23
58. (take_image rover1 waypoint5 objective3 camera2 high_res)
   deleted: (calibrated camera2 rover1)
   added: (have_image rover1 objective3 high_res)
   goals met: 13 of 23
59. (communicate_image_data rover1 general objective3 high_res waypoint5 waypoint1)
   added: (communicated_image_data objective3 high_res)
   goals met: 14 of 23
60. (calibrate rover1 camera2 objective6 waypoint5)
   added: (calibrated camera2 rover1)
   goals met: 14 of 23
61. (navigate rover1 waypoint5 waypoint2)
   deleted: (at rover1 waypoint5)
   added: (at rover1 waypoint2)
   goals met: 14 of 23
62. (take_image rover1 waypoint2 objective4 camera2 low_res)
   deleted: (calibrated camera2 rover1)
   added: (have_image rover1 objective4 low_res)
   goals met: 14 of 23
63. (communicate_image_data rover1 general objective4 low_res waypoint2 waypoint1)
   added: (communicated_image_data objective4 low_res)
   goals met: 15 of 23
64. (calibrate rover1 camera3 objective4 waypoint2)
   added: (calibrated camera3 rover1)
   goals met: 15 of 23
65. (navigate rover1 waypoint2 waypoint4)
   deleted: (at rover1 waypoint2)
   added: (at rover1 waypoint4)
   goals met: 15 of 23
66. (take_image rover1 waypoint4 objective3 camera3 colour)
   deleted: (calibrated camera3 rover1)
   added: (have_image rover1 objective3 colour)
   goals met: 15 of 23
67. (navigate rover1 waypoint4 waypoint5)
   deleted: (at rover1 waypoint4)
   added: (at rover1 waypoint5)
   goals met: 15 of 23
68. (communicate_image_data rover1 general objective3 colour waypoint5 waypoint1)
   added: (communicated_image_data objective3 colour)
   goals met: 16 of 23
69. (calibrate rover1 camera2 objective6 waypoint5)
   added: (calibrated camera2 rover1)
   goals met: 16 of 23
70. (take_image rover1 waypoint5 objective7 camera2 low_res)
   deleted: (calibrated camera2 rover1)
   added: (have_image rover1 objective7 low_res)
   goals met: 16 of 23
71. (communicate_image_data rover1 general objective7 low_res waypoint5 waypoint1)
   added: (communicated_image_data objective7 low_res)
   goals met: 17 of 23
72. (calibrate rover1 camera2 objective6 waypoint5)
   added: (calibrated camera2 rover1)
   goals met: 17 of 23
73. (take_image rover1 waypoint5 objective7 camera2 high_res)
   deleted: (calibrated camera2 rover1)
   added: (have_image rover1 objective7 high_res)
   goals met: 17 of 23
74. (communicate_image_data rover1 general objective7 high_res waypoint5 waypoint1)
   added: (communicated_image_data objective7 high_res)
   goals met: 18 of 23
75. (navigate rover1 waypoint5 waypoint2)
   deleted: (at rover1 waypoint5)
   added: (at rover1 waypoint2)
   goals met: 18 of 23
76. (calibrate rover1 camera3 objective4 waypoint2)
   added: (calibrated camera3 rover1)
   goals met: 18 of 23
77. (take_image rover1 waypoint2 objective5 camera3 colour)
   deleted: (calibrated camera3 rover1)
   added: (have_image rover1 objective5 colour)
   goals met: 18 of 23
78. (communicate_image_data rover1 general objective5 colour waypoint2 waypoint1)
   added: (communicated_image_data objective5 colour)
   goals met: 19 of 23
79. (calibrate rover1 camera3 objective4 waypoint2)
   added: (calibrated camera3 rover1)
   goals met: 19 of 23
80. (take_image rover1 waypoint2 objective4 camera3 colour)
   deleted: (calibrated camera3 rover1)
   added: (have_image rover1 objective4 colour)
   goals met: 19 of 23
81. (communicate_image_data rover1 general objective4 colour waypoint2 waypoint1)
   added: (communicated_image_data objective4 colour)
   goals met: 20 of 23
82. (calibrate rover1 camera2 objective6 waypoint2)
   added: (calibrated camera2 rover1)
   goals met: 20 of 23
83. (take_image rover1 waypoint2 objective8 camera2 low_res)
   deleted: (calibrated camera2 rover1)
   added: (have_image rover1 objective8 low_res)
   goals met: 20 of 23
84. (communicate_image_data rover1 general objective8 low_res waypoint2 waypoint1)
   added: (communicated_image_data objective8 low_res)
   goals met: 21 of 23
85. (calibrate rover1 camera2 objective6 waypoint2)
   added: (calibrated camera2 rover1)
   goals met: 21 of 23
86. (take_image rover1 waypoint2 objective5 camera2 high_res)
   deleted: (calibrated camera2 rover1)
   added: (have_image rover1 objective5 high_res)
   goals met: 21 of 23
87. (communicate_image_data rover1 general objective5 high_res waypoint2 waypoint1)
   added: (communicated_image_data objective5 high_res)
   goals met: 22 of 23
88. (calibrate rover1 camera2 objective6 waypoint2)
   added: (calibrated camera2 rover1)
   goals met: 22 of 23
89. (navigate rover1 waypoint2 waypoint4)
   deleted: (at rover1 waypoint2)
   added: (at rover1 waypoint4)
   goals met: 22 of 23
90. (take_image rover1 waypoint4 objective1 camera2 high_res)
   deleted: (calibrated camera2 rover1)
   added: (have_image rover1 objective1 high_res)
   goals met: 22 of 23
91. (navigate rover1 waypoint4 waypoint5)
   deleted: (at rover1 waypoint4)
   added: (at rover1 waypoint5)
   goals met: 22 of 23
92. (communicate_image_data rover1 general objective1 high_res waypoint5 waypoint1)
   added: (communicated_image_data objective1 high_res)
   goals met: 23 of 23
